{
    "en": {
        "Student" : "Student in Game Development",
        "MyDesc" : "Passionate about computer science and game development, I design and create various projects, from video games to technical tools. Curious and creative, I enjoy exploring new technologies and taking on challenges. Through my experiences, I have worked with engines such as Unity and Unreal Engine 5, as well as DirectX 12.",
        "popup-btn" : "Close",
        "skills-title" : "My Skills",
        "project-section-title" : "My Projects",
        "Uneven-skills" : "Skills : Unity, C#",
        "Uneven-desc" : "Uneven is a 3D narrative adventure game project. Created with Unity, our goal is to release a demo on Steam.",
        "Uneven-desc-popup" : "Uneven is a video game project that I am working on with 5 other developers. Created with Unity, this project has allowed me to reinforce my development skills, I also designed the puzzles of the game. I contributed to the development of the game design, level design, and storytelling. $$ This project has given me a better understanding of the challenges involved in developing an independent game, whether they are technical, organizational, or related to communication. $$ Our goal with Uneven is to release a demo on our Steam page.",
        "Uneven-link-popup" : "Link to Steam",
        "Uneven-btn" : "Learn More",
        "Malartre-skills" : "Skills : C#, Unity",
        "Malartre-desc" : "Creation of a mobile game in Unity for the Henri Malartre Automobile Museum.",
        "Malartre-desc-popup" : "The Malartre project is a point-and-click mobile game, currently in development under Unity, designed for the Henri Malartre Automobile Museum. $$ This project is an opportunity to explore new technical challenges, especially because it's my first mobile game and my first collaboration with artists. $$ To structure the work, we set up a backlog, organized the team into different departments, defined a precise naming convention, and adopted a Git workflow with regular branches and merges. $$ I am also discovering the constraints related to mobile publishing as well as working with a client and meeting their requirements.",
        "Malartre-btn" : "Learn More",
        "Engine-title" : "3D Engine",
        "Engine-skills" : "Skills : C++, DirectX 12",
        "Engine-desc" : "Development of a 3D rendering engine and a game in 4 weeks using DirectX12",
        "Engine-desc-popup" : "As part of a school project, my team and I developed a 3D rendering engine using DirectX 12 in four weeks and created a Space Shooter game on this engine. $$ I mainly worked on the management of colliders, meshes, and the Mesh Renderer. We used Git and GitHub to manage the code versions. $$ This project taught me to be thorough and patient in the face of technical challenges, while discovering how a game engine works.",
        "Engine-link-popup" : "Link to Github",
        "Engine-btn" : "Learn More",
        "Unreal-title" : "Project Unreal",
        "Unreal-skills" : "Skills : C++, Unreal Engine 5",
        "Unreal-desc" : "Development of a game on Unreal Engine 5, to explore the use of C++ in this engine.",
        "Unreal-desc-popup" : "Development of a post-apocalyptic top-down shooter game on Unreal Engine 5, with the goal of exploring the use of C++ in this engine. I focused on programming the enemies, developing their behaviors, animations, and attacks. $$ Discovering a new engine represented a challenge, especially in managing components, integrating AI, and the interaction between C++ and Blueprints. This project allowed me to deepen my AI programming skills while familiarizing myself with the specifics of Unreal Engine.",
        "Unreal-btn" : "Learn More"

    },
    "fr": {
       "Student" : "Etudiant en Développement Informatique et Jeux vidéo",
       "MyDesc": "Passionné par l'informatique et le développement de jeux vidéo,je conçois et réalise divers projets, du jeu vidéo aux outils techniques. Curieux et créatif, j’aime explorer de nouvelles technologies et relever des défis. À travers mes expériences, j’ai pu travailler sur des moteurs comme Unity et Unreal Engine 5, ainsi qu’avec DirectX 12.",
       "popup-btn" : "Fermer",
       "skills-title" : "Mes Compétences",
       "project-section-title" : "Mes Projets",
       "Uneven-skills" : "Compétences : Unity, C#",
       "Uneven-desc" : "Uneven est un projet de jeu vidéo narratif et d'aventure en 3D. Créé avec Unity, notre objectif est de sortir un démo sur Steam.",
       "Uneven-desc-popup" : "Uneven est un projet de jeu vidéo sur lequel je travaille avec 5 autres développeurs. Créé avec Unity, ce projet m’a permis de renforcer mes compétences en développement gameplay, notamment en concevant les puzzles et les énigmes du jeu. J’ai également participé à l’élaboration du game design, du level design, et de la narration. $$ Ce projet m’a offert une meilleure compréhension des défis liés au développement d’un jeu indépendant, qu’ils soient techniques, organisationnels, ou liés à la communication. $$ Notre objectif avec Uneven est de sortir une démo sur notre page Steam.",
       "Uneven-link-popup" : "Liens vers Steam",
       "Uneven-btn" : "En Savoir Plus",
       "Malartre-skills" : "Compétences : C#, Unity",
       "Malartre-desc" : "Création d’un jeu mobile sous Unity pour le musée de l’automobile Henri Malartre.",
       "Malartre-desc-popup" :"Le projet Malartre est un jeu mobile point-and-click, actuellement en développement sous Unity, conçu pour le musée de l’automobile Henri Malartre. $$ Ce projet est une opportunité d’explorer de nouvelles problématiques techniques, notamment avec mon premier développement mobile et ma première collaboration avec des artistes. $$ Pour structurer le travail, nous avons mis en place une backlog, organisé l’équipe en différents pôles, défini une nomenclature précise et adopté un workflow Git avec branches et merges réguliers. $$ Je découvre également les contraintes liées à la publication mobile ainsi que le travail avec un client et le respect de ses exigences.",
       "Malartre-btn" : "En Savoir Plus",
       "Engine-title" : "Moteur 3D",
       "Engine-skills" : "Compétence : C++, DirectX 12",
       "Engine-desc" : "Développement d’un moteur de rendu 3D et d’un jeu en 4 semaines en utilisant DirectX12",
       "Engine-desc-popup" : "Dans le cadre d’un projet scolaire, mon équipe et moi avons développé un moteur de rendu 3D sous DirectX 12 en quatre semaines et créer un jeu de type Space Shooter sur ce même moteur. $$ J’ai principalement travailler sur la gestion des colliders, des meshes et du Mesh Renderer. Nous avons utilisé Git et GitHub pour gérer les versions du code. $$ Ce projet m’a appris à être rigoureux et à faire preuve de patience face aux défis techniques, tout découvrant comment fonctionne un moteur",
       "Engine-link-popup" : "Liens vers Github",
       "Engine-btn" : "En Savoir Plus",
       "Unreal-title" : "Projet Unreal",
       "Unreal-skills" : "Compétences : C++, Unreal Engine 5",
       "Unreal-desc" : "Développement d’un jeu sur Unreal Engine 5, pour découvrir l’utilisation du C++ dans ce moteur.",
       "Unreal-desc-popup" : "Développement d’un jeu de tir post-apocalyptique en vue top-down sur Unreal Engine 5, avec pour objectif de découvrir l’utilisation du C++ dans ce moteur. Je me suis concentré sur la programmation des ennemis, en développant leurs comportements, leurs animations, leurs attaques. $$ Découvrir un nouveau moteur a représenté un défi, notamment sur la gestion des composants, l’intégration des IA et l’interaction entre C++ et Blueprints. Ce projet m’a permis d’approfondir mes compétences en programmation d’IA tout en me familiarisant avec les spécificités d’Unreal Engine.",
       "Unreal-btn" : "En Savoir Plus"
    }
}